{
    "device": "Device",
    "creation time": "Creation time",
    "risk metric": "Risk metric",
    "vulnerability type": "Vulnerability type",
    "sources": "Sources",
    "create new user": "Create new user",
    "login": "Login",
    "password": "Password",
    "create": "Create",
    "edit user": "Edit user",
    "change": "Change",
    "are you sure?": "Are you sure?",
    "yes": "Yes",
    "no": "No",
    "enter": "Enter",
    "add": "Add",
    "enter key": "Enter key",
    "your key": "Your key",
    "send": "Send",
    "domain": "Domain",
    "vulnerable software found": "Vulnerable software found",
    "list": {
        "0": {
            "title": "title",
            "details": [
                {
                    "subtitle": "subtitle1",
                    "description": "description1"
                },
                {
                    "subtitle": "subtitle2",
                    "description": "description2"
                },
                {
                    "subtitle": "subtitle3",
                    "description": "description3"
                }
            ]
        },
        "1": {
            "title": "Phishing attack detected on WI-FI",
            "details": [
                {
                    "subtitle": "Threat",
                    "description": "A phishing attack has been detected"
                },
                {
                    "subtitle": "Description",
                    "description": "Phishing attack on Wi-Fi networks = 'Man in the middle' attack + phishing page. The 'Man in the middle' attack is carried out as follows:",
                    "list": [
                        "A phishing access point is established with the name of the targeted network, but without a password",
                        "All or specific clients are disconnected from the targeted access point",
                        "When a client connects to the phishing network, the attacker gains control of unencrypted traffic",
                        "Having control of the traffic, the client is directed to a phishing page that requests the Wi-Fi password"
                    ]
                }
            ]
        },
        "2": {
            "title": "Incorrect admin panel password entered",
            "details": [
                {
                    "subtitle": "Threat",
                    "description": "There was an attempt to enter a password from IP address {{ip}} with user-agent {{userAgent}}. \nPassword: {{password}}, Login: {{login}}"
                }
            ]
        },
        "3": {
            "title": "DNS-rebinding",
            "details": [
                {
                    "subtitle": "Vulnerability",
                    "description": "Allows an attacker to gain access to web interfaces in the local network by luring the user to a specially crafted web page."
                },
                {
                    "subtitle": "Attack",
                    "description": [
                        "An attempt was made to connect from IP address {{ip}} using the domain name {{host}}. ",
                        "There were {{count}} attempts in total. ",
                        "The following user agent was sent during the attempt: {{userAgent}} "
                    ]
                },
                {
                    "subtitle": "Description",
                    "description": "The attacker registers a domain (e.g. dnsrebind.ru) and takes control of the DNS server that serves the domain. The DNS server is configured so that its responses have a very short time-to-live (TTL) for the records, preventing the client or resolver from caching the response. When the victim begins to navigate to the malicious domain, the attacker's DNS server initially returns the real IP address of the web server, which contains malicious JavaScript code. This malicious client-side code makes additional requests to the original domain name (dnsrebind.ru) in order to trigger expiration of the previous DNS response, after which the browser performs a new DNS query for the domain. The query again goes to the attacker's DNS server, but this time, the DNS server responds that the domain dnsrebind.ru is now located at some new IP address, such as the internal IP address of the local network or the IP address of some other website. The script request goes to another server. In the end, the browser sees that requests are being sent within the same domain and does not block them, allowing the attacker to send/receive any data to/from the web server with the targeted IP address. Typically, this attack is used to gain access to local web servers, such as the administrative panel of a router, printer, camera, or any other device with a web interface in the local network."
                },
                {
                    "subtitle": "Recommendations",
                    "description": "Disable the issuance of web interface content for requests containing an arbitrary domain name in the HTTP header \"host\"."
                }
            ]
        },
        "4": {
            "title": "Traffic interception detected (ARP-Spoofing)",
            "details": [
                {
                    "subtitle": "Threat",
                    "description": "The attacker carried out an ARP-Spoofing attack, which allows both interception and modification of incoming/outgoing network traffic between devices."
                },
                {
                    "subtitle": "Description",
                    "description": "\t\t1. Two computers A and B on the local Ethernet network exchange messages. The attacker X, who is also on this network, wants to intercept messages between these nodes. Before the ARP-spoofing attack is applied, the ARP table on node A's network interface contains the IP and MAC addresses of node B. Similarly, the ARP table on node B's network interface contains the IP and MAC addresses of node A.\n\t\t2. During the ARP-spoofing attack, node X (the attacker) sends two ARP replies (without a request) - to node A and node B. The ARP reply to node A contains the IP address of B and the MAC address of X. The ARP reply to node B contains the IP address of A and the MAC address of X.\n\t\t3. Since computers A and B support self-generated ARP, after receiving the ARP reply, they change their ARP tables, and now the ARP table of A contains the MAC address of X associated with the IP address of B, and the ARP table of B contains the MAC address of X associated with the IP address of A.\n\t\t4. Thus, the ARP-spoofing attack is executed, and now all packets (traffic) between A and B pass through X. For example, if A wants to send a packet to computer B, A looks in its ARP table, finds the record with the IP address of node B, selects the MAC address from there (and there is already the MAC address of node X) and sends the packet. The packet goes to X's interface, is analyzed by it, and then forwarded to node B.\n"
                },
                {
                    "subtitle": "Recommendations",
                    "description": "If the router has ARP traffic filtering settings, activate this setting. If this setting is not available, replace the router with one that is not vulnerable to ARP-Spoofing."
                }
            ]
        },
        "5": {
            "title": "Sending packets to disconnect users from wifi network",
            "details": [
                {
                    "subtitle": "Threat",
                    "description": "1. Network traffic interception is possible in the absence of protocol encryption or using vulnerabilities in encryption.\n2. Passwords from websites or WI-FI access points can be intercepted using phishing pages.\n3. Forced redirection of the user to an arbitrary website is possible when connecting to an access point (CAPTIVE PORTAL)."
                },
                {
                    "subtitle": "Description",
                    "description": "A deauthentication packet - a packet in which the router receives instructions from the client to disconnect. Currently, an attacker can send a packet disguised as a client, and the client will disconnect. When deauthentication packets are sent multiple times, the user cannot connect to the access point, because they are immediately disconnected upon connection."
                },
                {
                    "subtitle": "Recommendations",
                    "description": "Notify all users connected via WI-FI about the inadmissibility of connecting to open access points. Conduct training on recognizing elements of the system interface implemented using web pages."
                }
            ]
        },
        "7": {
            "title": "DHCP Spoofing attack performed",
            "details": [
                {
                    "subtitle": "Threat",
                    "description": "A fake DHCP server was set up in the local network with the IP address {{dhcp_server}}, which issued a pool of IP addresses to devices with MAC addresses {{target_mac}}, thereby creating a subnet where it can specify itself as a gateway for them and listen to their traffic."
                }
            ]
        },
        "13": {
            "title": "Device opened a new network port",
            "details": [
                {
                    "subtitle": "Placeholder",
                    "description": "description"
                },
                {
                    "subtitle": "Placeholder",
                    "description": "description"
                },
                {
                    "subtitle": "Placeholder",
                    "description": "description"
                }
            ]
        },
        "14": {
            "title": "Hosts file modification",
            "details": [
                {
                    "subtitle": "Threat",
                    "description": "Traffic redirection in the network by replacing the IP address of the domain. In this case, the following replacements were made:"
                },
                {
                    "subtitle": "Description",
                    "description": "The hosts file is used by the OS to match domains and IP addresses, regardless of what is defined in the DNS service. This mechanism is often used by attackers both for stealing data transmitted over the network by software installed on the device, and for redirecting users to phishing web pages."
                },
                {
                    "subtitle": "Recommendation",
                    "list": [
                        "Remove illegitimate entries from the hosts file.",
                        "Determine the source of appearance of these entries and eliminate their appearance in the future."
                    ]
                }
            ]
        },
        "16": {
            "title": "New device detected",
            "details": [
                {
                    "subtitle": "Threat",
                    "description": "An unidentified device \"<Name, if available>\" with IP address \"<such-and-such>\", MAC address \"<such-and-such>\" has connected to the network. It is possible that this device is being used for attack purposes."
                },
                {
                    "subtitle": "Recommendations",
                    "description": "If you have identified this device as legitimate, we recommend adding it to a \"white list\" so that it does not cause an incident in the future. Otherwise, we recommend identifying the connection point and taking the necessary measures to prevent further access."
                },
                {
                    "subtitle": "Counteraction",
                    "list": [
                        "Conduct reconnaissance - scan the attacker's device.",
                        "Block the attacker - use an \"ARP cage.\""
                    ]
                }
            ]
        },
        "17": {
            "title": "New wifi network detected",
            "details": [
                {
                    "subtitle": "Threat",
                    "description": "An unprotected WI-FI network {{asd}} has been detected. It can be used to conduct phishing attacks on users."
                },
                {
                    "subtitle": "Recommendations",
                    "description": "If you have identified this WI-FI network as legitimate, we recommend adding it to a \"white list\" so that it does not cause an incident in the future."
                },
                {
                    "subtitle": "Counteraction",
                    "list": [
                        "Conduct reconnaissance - connect to the attacker's WI-FI network and scan the network.",
                        "Block - forcibly disconnect all clients from this WI-FI network."
                    ]
                }
            ]
        }
    }
}
